app/controllers/incidents_controller.rb

  def index
    @incidents = Incident.all
---
SELECT * FROM `incidents`

  def show
    @incident = Incident.find(params[:id])
---
SELECT * FROM `incidents` WHERE (`incidents`.`id` = 1)

  def create
    @incident = Incident.new(params[:incident])
    if @incident.save
---
INSERT INTO `incidents` (`created_at`, `updated_at`, `priority`, `owner_id`, `user_id`, `description`, `item_id`, `status`) VALUES('2011-03-23 01:05:45', '2011-03-23 01:05:45', 1, 1, NULL, 'opa aophapi', NULL, 2)