app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT * FROM `items`

  def create
    @item = Item.new(params[:item])
    if @item.save
---
INSERT INTO `items` (`name`, `serial`, `created_at`, `updated_at`, `description`, `item_type`) VALUES('AllInOne', '12345', '2011-03-23 00:59:02', '2011-03-23 00:59:02', 'programa zuado', 1)